# Create Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DataStorage..::..Create Method
DataStorage Class See Also
---
Creates a new DataStorage element and adds it to the document.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static DataStorage Create(
	Document doc
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	doc As Document _
) As DataStorage
```

Visual C++
---
```text
public:
static DataStorage^ Create(
	Document^ doc
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document Document to which the new element should be added.
# ### Return Value
The newly created DataStorage element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DataStorage Class
Autodesk.Revit.DB.ExtensibleStorage Namespace